Repository: NicolaLS/payment-app
Catalog: feature/payment-ui/src/iosMain/resources/PaymentUI.xcstrings
Source language: en
Languages: de, es

# camera_permission_denied_body
source: Allow camera access in Settings to scan invoices.
de: Erlaube den Kamerazugriff in den Einstellungen, um Rechnungen zu scannen.
es: Permite el acceso a la cámara en Ajustes para escanear facturas.

# camera_permission_denied_title
source: Camera access is off
de: Kamerazugriff ist deaktiviert
es: El acceso a la cámara está desactivado

# camera_permission_open_settings
source: Open Settings
de: Einstellungen öffnen
es: Abrir Ajustes

# camera_permission_restricted_body
source: Camera access is unavailable because of this device’s restrictions.
de: Der Kamerazugriff ist aufgrund der Einschränkungen dieses Geräts nicht verfügbar.
es: El acceso a la cámara no está disponible debido a las restricciones de este dispositivo.

# camera_permission_restricted_title
source: Camera access is restricted
de: Kamerazugriff ist eingeschränkt
es: El acceso a la cámara está restringido

# camera_permission_retry
source: Try Again
de: Erneut versuchen
es: Intentar de nuevo

# completed_body
source: The previous payment completed. Review it or create an additional payment if you intend to pay again.
de: Die vorherige Zahlung wurde abgeschlossen. Zeige sie an oder erstelle eine zusätzliche Zahlung, wenn du erneut bezahlen möchtest.
es: El pago anterior se completó. Revísalo o crea un pago adicional si quieres volver a pagar.

# completed_title
source: Previous payment completed
de: Vorherige Zahlung abgeschlossen
es: Pago anterior completado

# confirm_payment_exact_amount
source: Exact amount: %1$@
de: Genauer Betrag: %1$@
es: Importe exacto: %1$@

# confirm_payment_title
source: Confirm Payment
de: Zahlung bestätigen
es: Confirmar pago

source: Create additional payment
de: Zusätzliche Zahlung erstellen
es: Crear pago adicional

# dismiss_button
source: Dismiss
de: Schließen
es: Cerrar

# enter_amount_title
source: Enter amount
de: Betrag eingeben
es: Introduce el importe

# error_exchange_rate_unavailable
source: Exchange rate unavailable for %1$@.
de: Wechselkurs für %1$@ nicht verfügbar.
es: El tipo de cambio para %1$@ no está disponible.

# error_invalid_invoice
source: This invoice is invalid or malformed.
de: Diese Rechnung ist ungültig oder fehlerhaft.
es: Esta factura es inválida o está malformada.

# error_invalid_invoice_with_details
source: This invoice is invalid: %1$@
de: Diese Rechnung ist ungültig: %1$@
es: Esta factura es inválida: %1$@

# error_lnurl
source: Failed to resolve this payment address.
de: Diese Zahlungsadresse konnte nicht aufgelöst werden.
es: No se pudo resolver esta dirección de pago.

# error_lnurl_with_details
source: Failed to resolve payment address: %1$@
de: Zahlungsadresse konnte nicht aufgelöst werden: %1$@
es: No se pudo resolver la dirección de pago: %1$@

# error_unexpected_generic
source: Something went wrong.
de: Es ist ein Fehler aufgetreten.
es: Algo salió mal.

# error_unexpected_with_details
source: Something went wrong: %1$@
de: Es ist ein Fehler aufgetreten: %1$@
es: Algo salió mal: %1$@

# in_progress_body
source: A payment for this request is still in progress. Review it to avoid paying twice, or create an additional payment only if you intend to pay again.
de: Eine Zahlung für diese Anfrage läuft noch. Zeige sie an, um eine doppelte Zahlung zu vermeiden, oder erstelle nur dann eine zusätzliche Zahlung, wenn du erneut bezahlen möchtest.
es: Un pago para esta solicitud sigue en curso. Revísalo para evitar pagar dos veces o crea un pago adicional solo si quieres volver a pagar.

# in_progress_title
source: Payment may still complete
de: Zahlung möglicherweise noch in Bearbeitung
es: El pago aún podría completarse

# lnurl_payment_image_description
source: Recipient image
de: Empfängerbild
es: Imagen del destinatario

# lnurl_payment_recipient
source: Recipient: %1$@
de: Empfänger: %1$@
es: Destinatario: %1$@

source: Open payment hub
de: Zahlungs-Hub öffnen
es: Abrir centro de pagos

# outcome_unknown_body
source: The previous payment may still have succeeded. Retry its exact invoice, review it, or intentionally create an additional payment.
de: Die vorherige Zahlung könnte erfolgreich gewesen sein. Versuche genau diese Rechnung erneut, zeige die Zahlung an oder erstelle bewusst eine zusätzliche Zahlung.
es: Es posible que el pago anterior haya sido exitoso. Reintenta exactamente su factura, revísalo o crea intencionalmente un pago adicional.

# outcome_unknown_title
source: Previous payment status unknown
de: Status der vorherigen Zahlung unbekannt
es: Estado del pago anterior desconocido

# pay_button
source: Pay
de: Bezahlen
es: Pagar

# payment_receipt_qr_content_description
source: Payment receipt QR code
de: QR-Code des Zahlungsbelegs
es: Código QR del recibo de pago

# point_camera_message_subtitle
source: Point the camera at an invoice.
de: Richte die Kamera auf eine Rechnung.
es: Apunta la cámara a una factura.

# resolving_payment_subtitle
source: No payment has been sent yet.
de: Es wurde noch keine Zahlung gesendet.
es: Todavía no se ha enviado ningún pago.

# resolving_payment_title
source: Preparing payment
de: Zahlung wird vorbereitet
es: Preparando el pago

# result_already_paid_message
source: No payment was sent. This invoice was already paid.
de: Es wurde keine Zahlung gesendet. Diese Rechnung wurde bereits bezahlt.
es: No se envió ningún pago. Esta factura ya fue pagada.

# result_already_paid_title
source: Already Paid
de: Bereits bezahlt
es: Ya pagada

# result_error_title
source: Error
de: Fehler

# result_paid_fee
source: Fee: %1$@
de: Gebühr: %1$@
es: Comisión: %1$@

# result_paid_title
source: Paid
de: Bezahlt
es: Pagado

# result_receipt_body_middle
source: of the paid invoice. The preimage can
de: der bezahlten Rechnung. Das Preimage kann
es: de la factura pagada. El preimage

# result_receipt_body_only
source: only
de: nur
es: solo

# result_receipt_body_prefix
source: This is the
de: Dies ist das
es: Este es el

# result_receipt_body_suffix
source: be known when the payment was settled.
de: bekannt sein, wenn die Zahlung abgeschlossen wurde.
es: se puede conocer cuando el pago fue liquidado.

# result_receipt_title
source: Payment receipt
de: Zahlungsbeleg
es: Recibo de pago

# result_view_receipt
source: View receipt
de: Beleg anzeigen
es: Ver recibo

source: Retry payment
de: Zahlung erneut versuchen
es: Reintentar pago

source: Retry previous invoice
de: Vorherige Rechnung erneut versuchen
es: Reintentar factura anterior

# scanner_close
source: Close scanner
de: Scanner schließen
es: Cerrar escáner

# session_transactions_empty
source: No payments in this session yet.
de: Noch keine Zahlungen in dieser Sitzung.
es: Aún no hay pagos en esta sesión.

# session_transactions_title
source: Recent payments
de: Letzte Zahlungen
es: Pagos recientes

# settings_title
source: Settings
de: Einstellungen
es: Ajustes

# tap_continue
source: Tap to continue…
de: Zum Fortfahren tippen…
es: Toca para continuar…

# tap_dismiss_pending
source: Tap to dismiss. Payment continues in background.
de: Tippen zum Schließen. Zahlung läuft im Hintergrund weiter.
es: Toca para cerrar. El pago continúa en segundo plano.

# toast_bitcoin_address
source: This is a Bitcoin address. Ask for a Lightning invoice.
de: Das ist eine Bitcoin-Adresse. Bitte um eine Lightning-Rechnung.
es: Esto es una dirección Bitcoin. Pide una factura Lightning.

# toast_bolt12_not_supported
source: BOLT12 offers are not yet supported.
de: BOLT12-Angebote werden noch nicht unterstützt.
es: Las ofertas BOLT12 aún no son compatibles.

# toast_lnurl_request_not_supported
source: This LNURL request cannot be paid.
de: Diese LNURL-Anfrage kann nicht bezahlt werden.
es: Esta solicitud LNURL no se puede pagar.

# toast_payment_link_not_supported
source: This payment link is not supported.
de: Dieser Zahlungslink wird nicht unterstützt.
es: Este enlace de pago no es compatible.

source: View previous payment
de: Vorherige Zahlung anzeigen
es: Ver pago anterior

source: View session transactions
de: Transaktionen dieser Sitzung anzeigen
es: Ver transacciones de esta sesión

# enter_amount_range_max
source: Max %1$@
es: Máx %1$@

# enter_amount_range_min
source: Min %1$@
es: Mín %1$@
